wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c


/**
 * Copyright (c) 2014 - 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 * This file contains a template for creating a new application. It has the code necessary to wakeup
 * from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"

//wright : Fix for not to infect GPIO output
//#include "bsp_btn_ble.h"

#include "app_scheduler.h"

#include "app_timer.h"

#include "sensorsim.h"

#include "nrf_pwr_mgmt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "m_coms_ble.h"

#include "m_coms_gzll.h"

#include "bsp_config.h"

#include "peer_manager.h"

#include "nrf_sdh.h"

#include "nrf_drv_clock.h"

#include "nrf_drv_gpiote.h"

#include "nrf_delay.h"

#include "nrf_sdm.h"

#include "project_params.h"

#define DEAD_BEEF                          0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SHIFT_BUTTON_ID                     1                                          /**< Button used as 'SHIFT' Key. */

#define BATTERY_LEVEL_MEAS_INTERVAL          APP_TIMER_TICKS(2000)                      /**< Battery level measurement interval (ticks). */
#define MIN_BATTERY_LEVEL                    81                                         /**< Minimum simulated battery level. */
#define MAX_BATTERY_LEVEL                    100                                        /**< Maximum simulated battery level. */
#define BATTERY_LEVEL_INCREMENT              1                                          /**< Increment between each simulated battery level measurement. */


#define SCHED_QUEUE_SIZE                     30
#define SCHED_MAX_EVENT_DATA_SIZE            MAX(sizeof(ble_evt_t), MAX(sizeof(app_timer_event_t) \
                                               , sizeof(m_coms_ble_evt_t)))              /**< Maximum size of scheduler events. */

#define MODIFIER_KEY_POS                     0                                          /**< Position of the modifier byte in the Input Report. */
#define SCAN_CODE_POS                        2                                          /**< The start position of the key scan code in a HID Report. */
#define SHIFT_KEY_CODE                       0x02                                       /**< Key code indicating the press of the Shift Key. */

#define MAX_KEYS_IN_ONE_REPORT               (INPUT_REPORT_KEYS_MAX_LEN - SCAN_CODE_POS) /**< Maximum number of key presses that can be sent in one Input Report. */

#define OUTPUT_REPORT_BIT_MASK_CAPS_LOCK     0x02                                       /**< CAPS LOCK bit in Output Report (based on 'LED Page (0x08)' of the Universal Serial Bus HID Usage Tables). */

//wright : change for test
//#define M_COMS_BLE_MODE                      0
//#define M_COMS_GZLL_MODE                     1																							 
#define M_COMS_BLE_MODE                      1
#define M_COMS_GZLL_MODE                     0
																							 
																							 
#define PROTOCOL_DETECT_PIN                  3

																							 
#define APP_GZLL_SEARCH_INTERVAL             APP_TIMER_TICKS(1000)
																							 
																							 
																				 
																							 

/********************************* wright : header and defines ******************************/

#include "m_keyboard.h"
#include "m_pwr_and_clk_mgmt.h"


/********************************* wright : fds part *************************************/

//wright: mode selection 
#include "fds.h"
#define LAST_TRANSMIT_MODE_FILE_ID 0x1111
#define LAST_TRANSMIT_MODE_RECORD_KEY 0x2222
#define DELETE_RECORD_NOT_FOUND 0xEEEE
#define REC_DEFAULT_VALUE 0xFFFF
#define DEFAULT_TRANSMIT_MODE 0x0000 //Gazell

static void fds_evt_handler(fds_evt_t const * p_evt);
static ret_code_t mode_record_delete(void);
static ret_code_t mode_record_write(uint32_t mode_value);
static ret_code_t mode_record_read(void);


/* Flag to check fds initialization. */
static bool volatile m_fds_initialized;
bool fds_busy_flag = false;
uint32_t current_transmit_mode_data[1] = {DEFAULT_TRANSMIT_MODE};

static struct
{
    bool delete_next;   //!< Delete next record.
    bool pending;       //!< Waiting for an fds FDS_EVT_DEL_RECORD event, to delete the next record.
} m_delete_all;

/********************************* wright : fds part *************************************/



/********************************* wright apptimer start ******************************/

APP_TIMER_DEF(m_write_fds_data_timer_id);  
bool fds_timer_is_start = false;
#define SIMPLE_DELAY_INTERVAL      			 APP_TIMER_TICKS(1000) /**< simple delay interval (ticks). */
static void current_mode_writer_timeout_handler(void * p_context);


