wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
    // Prepare wakeup buttons.
		//wright : fix for not to infect GPIO output
    //err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);
	
	  NRF_LOG_INFO("Go to sleep zzzzz");	
	       
		 m_coms_ble_sleep_mode_enter();		 
}


//wright : fix for not to infect GPIO output

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
//static void bsp_event_handler(bsp_event_t event)
//{
// //ret_code_t err_code;
//	static uint8_t * p_key = m_sample_key_press_scan_str;
//  static uint8_t   size  = 0;
//  
//  switch (event)
//    {
//       case BSP_EVENT_SLEEP:
//            //sleep_mode_enter();
//            break;
//			 
//			 case BSP_EVENT_DISCONNECT:
//            m_coms_ble_diconnect();
//			    
//            break;
//			 
//			 case BSP_EVENT_WHITELIST_OFF:
//			      m_coms_ble_whitelist_off();
//			 
//			      break;
//			 
//			 case BSP_EVENT_KEY_0:
//            //if (is_bonded)
//            //{
//                keys_send(2, p_key);
//                p_key++;
//                size++;
//                if (size == MAX_KEYS_IN_ONE_REPORT)
//                {
//                    p_key = m_sample_key_press_scan_str;
//                    size  = 0;
//                }
//            //}
//            break;
//        default:
//            break;
//    }
//}


//wright : fix for not to infect GPIO output
///**@brief Function for initializing buttons and leds.
// *
// * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
// */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    ret_code_t err_code;
//    bsp_event_t startup_event;

//    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);

//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);

//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    app_sched_execute();
	
	  if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void m_coms_ble_evt_handler(void * p_event_data, uint16_t event_size)
{
	 m_coms_ble_evt_t * p_evt = (m_coms_ble_evt_t *) p_event_data;;
   uint32_t           err_code;
   uint8_t            report;
	

	 switch (p_evt->type)
   {
		 
		 case M_COMS_BLE_EVT_ADV_DIRECTED_HIGH_DUTY:			 
		      NRF_LOG_INFO("High Duty Directed advertising.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
          //APP_ERROR_CHECK(err_code);
          break;
		 
		 case M_COMS_BLE_EVT_ADV_DIRECTED:
			    NRF_LOG_INFO("Directed advertising.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
          //APP_ERROR_CHECK(err_code);	 
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_FAST:			   
          NRF_LOG_INFO("Fast advertising.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
          //APP_ERROR_CHECK(err_code);
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_SLOW:
			    NRF_LOG_INFO("Slow advertising.");
					//wright : fix for not to infect GPIO output
          //err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
          //APP_ERROR_CHECK(err_code);
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_FAST_WHITELIST:
			    NRF_LOG_INFO("Fast advertising with whitelist.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
          //APP_ERROR_CHECK(err_code);
		      break;
		 
		 case M_COMS_BLE_EVT_ADV_SLOW_WHITELIST:
			    NRF_LOG_INFO("Slow advertising with whitelist.");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
          //APP_ERROR_CHECK(err_code);
		      break;
			
		 case M_COMS_BLE_EVT_ADV_IDLE:
			 //wright : debug		
		 NRF_LOG_INFO("-----M_COMS_BLE_EVT_ADV_IDLE-----");
			    //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_IDLE);
          //APP_ERROR_CHECK(err_code);
		      sleep_mode_enter();
          break;
         
		 
		 case M_COMS_BLE_EVT_CONNECTED:
			    NRF_LOG_INFO("Connected");
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
          //APP_ERROR_CHECK(err_code);	
		      break;
		 
		 case M_COMS_BLE_EVT_DISCONNECTED:
			 
					//wright : TODO find the reason about disconection.
		      NRF_LOG_INFO("Disconnected");
          // Dequeue all keys without transmission.
          //(void) buffer_dequeue(false);	        
          // Reset m_caps_on variable. Upon reconnect, the HID host will re-send the Output
          // report containing the Caps lock state.
          m_caps_on = false;
          // disabling alert 3. signal - used for capslock ON
		 
          //wright : fix for not to infect GPIO output
					//err_code = bsp_indication_set(BSP_INDICATE_ALERT_OFF);
          //APP_ERROR_CHECK(err_code);	
		      //bsp_board_led_off(BSP_LED_INDICATE_USER_LED1);
		      //bsp_board_led_off(BSP_LED_INDICATE_USER_LED2);
		 
          break;
		 
		 case M_COMS_BLE_EVT_DATA_RECEIVED:			 
		      report = *p_evt->data_received.data;
			    on_hid_rep_char_write(report, p_evt->data_received.len); 
		      break;
		 
		 case M_COMS_BLE_EVT_BONDED:
			    NRF_LOG_INFO("Bonded");
			    //is_bonded = true;
		 
		 
		      //wright : fix for not to infect GPIO output
					//bsp_board_led_on(BSP_LED_INDICATE_USER_LED2);		
		 
		      break;
		 
		 default:
		 break;
		 
