wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
	 }	 
}   


static void m_coms_gzll_evt_handler(void * p_event_data, uint16_t event_size)
{
	  gzll_event_t * p_evt = (gzll_event_t *) p_event_data;
	
	
	  switch (*p_evt)
    {
        case gzll_event_search_for_host:
	           NRF_LOG_INFO("Search for Host.");
//             bsp_board_led_invert(BSP_LED_INDICATE_USER_LED3); 
				     app_timer_start(m_app_gzll_search_timer_id, APP_GZLL_SEARCH_INTERVAL, NULL);
             break;				
						  
			  case gzll_event_sysaddr_exchanged:
					   NRF_LOG_INFO("Paired with Host");
//             bsp_board_led_on(BSP_LED_INDICATE_USER_LED3);
				     break;
				
				case gzll_event_hostid_exchanged:
					   NRF_LOG_INFO("Bonded with Host");
			       //is_bonded = true;
//		         bsp_board_led_on(BSP_LED_INDICATE_USER_LED4);		
				     break;
				
				case gzll_event_tx_failed:
//					    NRF_LOG_INFO("GZLL transmit failed !!");
//				      bsp_board_led_off(BSP_LED_INDICATE_USER_LED3);	
//				      bsp_board_led_off(BSP_LED_INDICATE_USER_LED4);	
				     break;
				
				default:
					   break;
				
		}		
}	

/**@brief Function for initializing 
 */
static void modules_init(void)
{		
   //buffer_init();
	 sensor_simulator_init();
   power_management_init();

	 
	if(m_protocol_mode == M_COMS_BLE_MODE)
	{	
     m_coms_ble_init(m_coms_ble_evt_handler);
  }
  else
	{	
	  clock_start();
	  m_coms_gzll_init(m_coms_gzll_evt_handler);
		
	}	

}	


static void modules_enable(bool erase_bonds)
{

  if(m_protocol_mode == M_COMS_BLE_MODE)
	{	
	
		m_coms_ble_enable(erase_bonds);
		 NRF_LOG_INFO("BLE mode start.");
	}	
	else
	{				
	   m_coms_gzll_enable(erase_bonds);
		 m_coms_gzll_search_for_host();
     NRF_LOG_INFO("GZLL mode start.");		
	}	
		
}

static void protocol_det_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	uint8_t level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
	uint8_t is_softdevice_enabled;
	
  if (pin == PROTOCOL_DETECT_PIN)
	{
	
    NRF_LOG_INFO("Reset!!");
	
    nrf_delay_ms(100);
		
		sd_softdevice_is_enabled(&is_softdevice_enabled);
		
		if (is_softdevice_enabled==1)
		{	
		  sd_nvic_SystemReset();
		}
		else
		{
      NVIC_SystemReset();
    }			

  }		
	
	
}	




/**@brief Initialization of unused I/Os
 */
static void misc_io_init(void)
{
    ret_code_t err_code; 
	  int i;
    uint32_t unused_pins[] = {0, 1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 26, 27, 28, 29, 30, 31};  
    uint8_t  level;   

    for (i = 0; i < (sizeof(unused_pins) / sizeof(unused_pins[0])); ++i)
    {
        uint32_t pin = unused_pins[i];
        
        NRF_GPIO->PIN_CNF[pin] =
            (GPIO_PIN_CNF_DIR_Input        << GPIO_PIN_CNF_DIR_Pos)    |
            (GPIO_PIN_CNF_INPUT_Disconnect << GPIO_PIN_CNF_INPUT_Pos)  |
            (GPIO_PIN_CNF_PULL_Disabled    << GPIO_PIN_CNF_PULL_Pos)   |
            (GPIO_PIN_CNF_DRIVE_S0S1       << GPIO_PIN_CNF_DRIVE_Pos)  |
            (GPIO_PIN_CNF_SENSE_Disabled   << GPIO_PIN_CNF_SENSE_Pos);           
    }     
		
				//Set P0.03 as a protocol detect input pin, default GZLL, GND to BLE
		   NRF_GPIO->PIN_CNF[PROTOCOL_DETECT_PIN] =
		        (GPIO_PIN_CNF_DIR_Input        << GPIO_PIN_CNF_DIR_Pos)    |
            (GPIO_PIN_CNF_INPUT_Connect    << GPIO_PIN_CNF_INPUT_Pos)  |
            (GPIO_PIN_CNF_PULL_Pullup      << GPIO_PIN_CNF_PULL_Pos)   |
            (GPIO_PIN_CNF_DRIVE_S0S1       << GPIO_PIN_CNF_DRIVE_Pos)  |
            (GPIO_PIN_CNF_SENSE_Disabled   << GPIO_PIN_CNF_SENSE_Pos);
		
		level = nrf_gpio_pin_read(PROTOCOL_DETECT_PIN);
		
		if (!nrf_drv_gpiote_is_init())
    {
		   err_code = nrf_drv_gpiote_init();
       APP_ERROR_CHECK(err_code);
		}
		//Set P0.03 as a protocol detect input pin, VDD to GZLL, GND to BLE
		memset(&protocol_detect_pin_cfg, 0, sizeof(protocol_detect_pin_cfg));
		protocol_detect_pin_cfg.hi_accuracy = true;
	  
		protocol_detect_pin_cfg.sense = (level==M_COMS_BLE_MODE)? NRF_GPIOTE_POLARITY_LOTOHI : NRF_GPIOTE_POLARITY_HITOLO  ;
		protocol_detect_pin_cfg.pull  = (level==M_COMS_BLE_MODE)? NRF_GPIO_PIN_PULLDOWN : NRF_GPIO_PIN_PULLUP ;
		
		NRF_LOG_INFO("protocol detect pin toggled, level = %d", nrf_gpio_pin_read(PROTOCOL_DETECT_PIN) );
		
		err_code = nrf_drv_gpiote_in_init(PROTOCOL_DETECT_PIN, &protocol_detect_pin_cfg, protocol_det_pin_handler);
		APP_ERROR_CHECK(err_code);
		
		nrf_drv_gpiote_in_event_enable(PROTOCOL_DETECT_PIN, true);
	
}			


/************************************* wright : add keyboard function **************************************/


/**@brief Handler function for keyboard module events
 */
//wright : for mode selection

static uint8_t KEY_CODE_BLE_MODE = 0xAA;
static uint8_t KEY_CODE_GARZLL_MODE = 0xAB;
bool IS_KEY_CODE_MODE_PRESSED = false;


static void m_keyboard_handler(void * p_event_data, uint16_t event_size)
{
    uint32_t            err_code;
    m_keyboard_data_t * keyboard_pkt;
    
    ASSERT(event_size == sizeof(m_keyboard_data_t));
    
    keyboard_pkt = (m_keyboard_data_t *) p_event_data;
	
	//wright : Try to send key value by 52 series way
	// 1.Try to get data from m_keyborad_handler (Before HW ready, Use Fake Data)
	// 2.figure out the format of data
	// 3.try to reproduce the sending proccess of 52 series
		NRF_LOG_INFO("---Enter m_keyboard_handler!---");
	
	//wright : send a fake key package 
//		m_keyboard_data_t new_key_data;
//		m_keyboard_data_t * fake_key_data = &new_key_data; 

		//fake data : wright 
//		uint8_t fake_str[M_KEYBOARD_MAX_NUM_KEYS] = /**< Key pattern to be sent when the key press button has been pushed. */
//		{
//				0xE1,       //shift key code
//				0x00,       
//				0x00,       
//				0x00,       
//				0x00,       
//				0x00        
//		};
//		fake_key_data->modifier_keys = 0x02;
//		memcpy(fake_key_data->keys,fake_str,M_KEYBOARD_MAX_NUM_KEYS);
//		fake_key_data->num_keys=0x01;
//		fake_key_data->pairing_button=0x00;
//	
		if (keyboard_pkt->pairing_button)
    {
			//do nothing
		}
		else
		{
				//if user pressed mode change btn combo (fn+1;fn+2)
				//0.stop polling	
				//1.delete mode data 
				//2.write mode data to flash 
				//3.reset 
//				if(keyboard_pkt->keys[0] == KEY_CODE_BLE_MODE)
//				{
//					NRF_LOG_INFO("---PRESS KEY_CODE_BLE_MODE !---");
//					IS_KEY_CODE_MODE_PRESSED = true;
//					current_transmit_mode_data[0] = M_COMS_BLE_MODE;
//				}
//					
//				
//				if(keyboard_pkt->keys[0] == KEY_CODE_GARZLL_MODE)	
//				{
//					NRF_LOG_INFO("---PRESS KEY_CODE_GARZLL_MODE !---");
//					IS_KEY_CODE_MODE_PRESSED = true;
//					current_transmit_mode_data[0] = M_COMS_GZLL_MODE;
//				}
//						
//			
//				if(
//						!fds_timer_is_start&&
//						m_keyboard_packet_is_empty(keyboard_pkt)&&
//						IS_KEY_CODE_MODE_PRESSED
//					)
//					{
//						NRF_LOG_INFO("---KEY_CODE_MODE_PRESSED & Released!---");
//						fds_timer_is_start = true;
//						err_code = app_timer_start(m_write_fds_data_timer_id, SIMPLE_DELAY_INTERVAL, NULL);
//					}
				//wright : fake key package	
//				NRF_LOG_INFO("---Keys_send---");
//				NRF_LOG_INFO("Num_Key: %d",fake_key_data->num_keys);
//				NRF_LOG_HEXDUMP_INFO(fake_key_data->keys, 6);
//				keys_send(fake_key_data->num_keys,fake_key_data->keys);
			
