wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
				//wright : actual key package
//				
//				NRF_LOG_INFO("Num_Key: %d",keyboard_pkt->num_keys);
//				NRF_LOG_HEXDUMP_INFO(keyboard_pkt->keys, 6);
//			

//				NRF_LOG_INFO("---Keys_send---");
				keys_send_fix(keyboard_pkt->num_keys,keyboard_pkt->keys,keyboard_pkt->modifier_keys);
				
		}

    
//    if (keyboard_pkt->pairing_button)
//    {
//        uint8_t release_report[8] = {0};
//        
//        app_timer_stop(s_gzll_keep_alive_id);
//        
//        // Stop buffer timer and flush
//        if (s_buffer_timer_running)
//        {
//            err_code = app_timer_stop(s_packet_buffer_id);
//            APP_ERROR_CHECK(err_code);
//            s_buffer_timer_running = false;
//        }
//        
//        s_packet_buffer.start_idx = 0;
//        s_packet_buffer.end_idx = 0;
//        
//        if(s_connection_state == state_connected)
//        {
//            // Send release packet
//            m_coms_hid_report_send(release_report, 
//                                   sizeof(release_report), 
//                                   0,
//                                   s_hid_reports.keyboard_rep_idx);     
//       }                               
//        // Start bonding
//        m_coms_bonding_start();
//    }
//    else
//    {
//        if (s_waiting_for_passkey)
//        {
//            if (keyboard_pkt->num_keys > 0)
//            {
//                memcpy(&s_passkey_buf[s_passkey_idx], keyboard_pkt->keys, keyboard_pkt->num_keys);
//                s_passkey_idx += keyboard_pkt->num_keys;
//                
//                if (s_passkey_idx >= 6)
//                {
//                    err_code = m_coms_ble_passkey_set(s_passkey_buf);
//                    APP_ERROR_CHECK(err_code);
//                    s_passkey_idx = 0;
//                }
//            }
//        }
//        else
//        {
//            buffer_keys(keyboard_pkt);    
//            memcpy(&s_gzll_keepalive_keyboard_pkt, keyboard_pkt, sizeof(m_keyboard_data_t));
//        
//            if (s_protocol_mode == protocol_mode_gzll)
//            {
//                if (m_keyboard_packet_is_empty(keyboard_pkt))
//                {
//                    app_timer_stop(s_gzll_keep_alive_id);
//                }
//                else
//                {
//                    app_timer_start(s_gzll_keep_alive_id, APP_TIMER_TICKS(500, APP_TIMER_PRESCALER), 0);
//                }
//            }
//        }
//    }
    // Notifying the power manager of activity
    m_pwr_mgmt_feed();
}





void keyboard_module_enable(void)
{
    uint32_t err_code;

	//wright : waiting for Jennifer's reply
	
//    err_code = m_coms_ble_report_descriptor_add(s_keyboard_hid_descriptor, sizeof(s_keyboard_hid_descriptor), ble_boot_pkt_keyboard, &s_hid_interface_idx);
//    APP_ERROR_CHECK(err_code);
//    
//    err_code = m_coms_ble_report_id_map(s_hid_interface_idx, hid_report_type_input, false, 0, 8, &s_hid_reports.keyboard_rep_idx);
//    APP_ERROR_CHECK(err_code);
//    
//    err_code = m_coms_ble_report_id_map(s_hid_interface_idx, hid_report_type_output, false, 0, 1, &s_hid_reports.output_rep_idx);
//    APP_ERROR_CHECK(err_code);
//    
//    err_code = m_coms_ble_report_id_map(s_hid_interface_idx, hid_report_type_feature, false, 0, 2, &s_hid_reports.feature_rep_idx);
//    APP_ERROR_CHECK(err_code);
        // Keyboard module. 
	
	
    err_code = m_keyboard_init(keyboard_format_usbhid, m_keyboard_handler);    
    APP_ERROR_CHECK(err_code); 
    m_keyboard_matrix_enable();
	
	return;


}


/************************************* wright : add keyboard function end**************************************/








//wright : get current mode (ble/gazll) for power manager module
bool get_current_mode()
{
    return m_protocol_mode;
}







/********************************* wright : FDS part ******************************/



static void fds_evt_handler(fds_evt_t const * p_evt)
{
    switch (p_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_INIT Success:");
                m_fds_initialized = true;
            }
            break;

        case FDS_EVT_WRITE:
        {
            if (p_evt->result == FDS_SUCCESS)
            {		
								NRF_LOG_INFO("FDS_EVT_WRITE Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->write.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->write.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->write.record_key);
								fds_busy_flag = false;
            }
        } break;

        case FDS_EVT_DEL_RECORD:
        {
            if (p_evt->result == FDS_SUCCESS)
            {
								NRF_LOG_INFO("FDS_EVT_DEL_RECORD Success:");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
								fds_busy_flag = false;
            }
        } break;

        default:
            break;
    }
}



static ret_code_t mode_record_delete(void)
{
		fds_busy_flag = true;
    fds_find_token_t tok   = {0};
    fds_record_desc_t desc = {0};
		ret_code_t rc = REC_DEFAULT_VALUE;

    if (fds_record_find(LAST_TRANSMIT_MODE_FILE_ID, LAST_TRANSMIT_MODE_RECORD_KEY, &desc, &tok) == FDS_SUCCESS)
    {
        rc = fds_record_delete(&desc);
        if (rc != FDS_SUCCESS)
        {
						NRF_LOG_INFO("error: fds_record_delete %x",rc);

            return rc;
        }

//        NRF_LOG_INFO("SUCCESS: fds_record_delete -- fid = %X,  rk= %X ",
//				LAST_TRANSMIT_MODE_FILE_ID,
//				LAST_TRANSMIT_MODE_RECORD_KEY);
    }
    else
    {
        NRF_LOG_INFO("record not found!\r\n");
				rc = DELETE_RECORD_NOT_FOUND;
				fds_busy_flag = false;
    }
		
		return rc;
}

static ret_code_t mode_record_write(uint32_t mode_value)
{
		fds_busy_flag = true;
    fds_record_t const rec =
    {
        .file_id           = LAST_TRANSMIT_MODE_FILE_ID,
        .key               = LAST_TRANSMIT_MODE_RECORD_KEY,
        .data.p_data       = &mode_value,
        .data.length_words = (2 + 3) / sizeof(uint32_t)
    };


    ret_code_t rc = fds_record_write(NULL, &rec);
    if (rc != FDS_SUCCESS)
    {
			NRF_LOG_INFO("fds_record_write failed... error code %d",rc);
    }
		return rc;
}



