wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/app.dual_mode_kb.protocol_sw/main-dual_mode_kb.c
static ret_code_t mode_record_read(void)
{
		//there is no need to pend while reading fds data
		//fds_busy_flag = true;
    fds_record_desc_t desc = {0};
    fds_find_token_t  tok  = {0};
		ret_code_t rc;
		fds_flash_record_t frec = {0};
		//uint32_t data_read[1] ={0};
			
		rc=fds_record_find(LAST_TRANSMIT_MODE_FILE_ID,LAST_TRANSMIT_MODE_RECORD_KEY,&desc,&tok);
		if (rc == FDS_SUCCESS)
		{
				rc = fds_record_open(&desc, &frec);
				if(rc == FDS_SUCCESS)
				{
					current_transmit_mode_data[0] = *(uint32_t *)frec.p_data; 
					NRF_LOG_INFO("current_transmit_mode_data = %x",current_transmit_mode_data[0]);
					rc = fds_record_close(&desc);			
				}
				else
				{
					NRF_LOG_INFO("open failed!");
				}
			
		}
		else
		{
			NRF_LOG_INFO("can't find last transmit mode ! --- Use Default Mode");
			//fds_busy_flag = false;
		}

		
		return rc;
}


/**@brief   Wait for fds to initialize. */
static void wait_for_fds_ready(void)
{
    while (!m_fds_initialized)
    {
        idle_state_handle();
    }
}





//wright: mode selection 

#define DEFAULT_TRANSMIT_MODE 0x0000 //Gazell
bool mode_selection()
{

		bool mode_result;
		//wright :FDS Logic TODO 
		//Init Fds module & Register handler
		ret_code_t ret;

		/* Register first to receive an event when initialization is complete. */
		(void) fds_register(fds_evt_handler);
	
		ret = fds_init();
		wait_for_fds_ready();


		NRF_LOG_INFO("--- record read ---");
		ret = mode_record_read();
		while(fds_busy_flag==true){idle_state_handle();}

		
		//decide transmit mode
		mode_result =(current_transmit_mode_data[0] == DEFAULT_TRANSMIT_MODE) ;
		
		return mode_result;
}
/********************************* wright : FDS part end ******************************/






/********************************* wright apptimer start ******************************/

static void current_mode_writer_timeout_handler(void * p_context)
{
			//wright : in order to avoid peer manager's affect (it also use FDS module), re-init fds with new fds event handler
			/* Register first to receive an event when initialization is complete. */
//			ret_code_t ret;
//			(void) fds_register(fds_evt_handler);

//			ret = fds_init();
//			wait_for_fds_ready();
	

			NRF_LOG_INFO("enter mode writer handler , current_transmit_mode_data[0] : %x ",
										current_transmit_mode_data[0]);

			m_keyboard_polling_disable();
			mode_record_delete();
			while(fds_busy_flag==true){idle_state_handle();}
			mode_record_write(current_transmit_mode_data[0]);
			while(fds_busy_flag==true){idle_state_handle();}
		
			NVIC_SystemReset();
}




/****************************** wright apptimer end ******************************/




/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;  

    // Initialize.
    log_init();

   // misc_io_init();    //For protocol mode setting & unused pins	
	
	
		//wright : Mode selection
	
//		m_protocol_mode = 
//		((mode_selection())?M_COMS_GZLL_MODE:M_COMS_BLE_MODE) ;

    m_protocol_mode = M_COMS_BLE_MODE;//((nrf_gpio_pin_read(PROTOCOL_DETECT_PIN) == 0)?M_COMS_BLE_MODE:M_COMS_GZLL_MODE) ;

    timers_init();	

    scheduler_init();
		
		//wright : fix for not to infect GPIO output
    //buttons_leds_init(&erase_bonds);

    modules_init();

    NRF_LOG_INFO("Dual mode keyboard example started.");

    modules_enable(erase_bonds);

    application_timers_start();
		
		

    //wright : enable keyboard module.
    keyboard_module_enable();

   

    // Enter main loop.
    for (;;)
    {
    idle_state_handle();
    }
}



















